package pavelkorzhenko; /**
 * @author Pavel Korzhenko
 * @version 0.1 2017/10/30
 * @task 02
 * @mark
 */


/**
 * 1. Напишите метод, на вход которого подаётся двумерный строковый массив размером 4х4, при подаче массива
 *    другого размера необходимо бросить исключение ArrayIndexOutOfBoundsException.
 * 2. Далее метод должен пройтись по всем элементам массива, преобразовать в int, и просуммировать. Если в
 *    каком-то элементе массива преобразование не удалось (например, в ячейке лежит символ или текст вместо числа),
 *    должно быть брошено исключение ArithmeticException, с детализацией в какой именно ячейке лежат неверные данные.
 * 3. В методе main() вызвать полученный метод, обработать возможные исключения ArithmeticException и
 *    ArrayIndexOutOfBoundsException, и вывести результат расчета.
 * 4. * Вариант повышенной сложности: данные берутся из текстового файла.
 */
public class GbJava2Task02 {
    public static void main(String[] args) {

    }
}
